"""Даны 2 действительных числа a и b. Получить их сумму, разность и произведение."""

a = 2
b = 3
print((a + b), (a - b), a * b)
