"""Даны действительные числа x и y. Получить

Для нахождения модуля использовать функцию abs(..)
"""
a = 2
b = 3
print((abs(a) - abs(b)) / (1 + abs(a * b)))