"""Дана длина ребра куба. Найти объем куба и площадь всей его поверхности.
"""
a = 3
print(f"Объем куба {(a ** 3)}")
print(f"Площадь поверхности куба {(a ** 2) * 6}")