"""oop_01
Создать файл dog.py.
Создать пустой класс Dog
oop_02
Создать два объекта класса Dog. Вывести их на экран
"""


class Dog:
    pass


dog_1 = Dog()
dog_2 = Dog()

print(dog_1)
print(dog_2)