"""Выведите на экран n раз фразу "I am a programmer". Число n вводит пользователь."""

n = int(input("Enter number: "))
i = 0
while i < n:
    print("I am a programmer")
    i += 1