# Создать строку. Получить приозвольную подстроку с начала и до седьмого елемента
# НАписать два решения использованием полной и сокращенной записи

my_line = "qwertyui"
print(my_line[0:7])
print(my_line[:7])